MikroElektronika/core_packages/PIC/XC8/def/PIC16F1578/mcu.h
extern volatile PWM3PHLbits_t PWM3PHLbits __at(0xDB1);
// bitfield macros
#define _PWM3PHL_PH_POSN                                    0x0
#define _PWM3PHL_PH_POSITION                                0x0
#define _PWM3PHL_PH_SIZE                                    0x8
#define _PWM3PHL_PH_LENGTH                                  0x8
#define _PWM3PHL_PH_MASK                                    0xFF
#define _PWM3PHL_PWM3PHL0_POSN                              0x0
#define _PWM3PHL_PWM3PHL0_POSITION                          0x0
#define _PWM3PHL_PWM3PHL0_SIZE                              0x1
#define _PWM3PHL_PWM3PHL0_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL0_MASK                              0x1
#define _PWM3PHL_PWM3PHL1_POSN                              0x1
#define _PWM3PHL_PWM3PHL1_POSITION                          0x1
#define _PWM3PHL_PWM3PHL1_SIZE                              0x1
#define _PWM3PHL_PWM3PHL1_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL1_MASK                              0x2
#define _PWM3PHL_PWM3PHL2_POSN                              0x2
#define _PWM3PHL_PWM3PHL2_POSITION                          0x2
#define _PWM3PHL_PWM3PHL2_SIZE                              0x1
#define _PWM3PHL_PWM3PHL2_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL2_MASK                              0x4
#define _PWM3PHL_PWM3PHL3_POSN                              0x3
#define _PWM3PHL_PWM3PHL3_POSITION                          0x3
#define _PWM3PHL_PWM3PHL3_SIZE                              0x1
#define _PWM3PHL_PWM3PHL3_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL3_MASK                              0x8
#define _PWM3PHL_PWM3PHL4_POSN                              0x4
#define _PWM3PHL_PWM3PHL4_POSITION                          0x4
#define _PWM3PHL_PWM3PHL4_SIZE                              0x1
#define _PWM3PHL_PWM3PHL4_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL4_MASK                              0x10
#define _PWM3PHL_PWM3PHL5_POSN                              0x5
#define _PWM3PHL_PWM3PHL5_POSITION                          0x5
#define _PWM3PHL_PWM3PHL5_SIZE                              0x1
#define _PWM3PHL_PWM3PHL5_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL5_MASK                              0x20
#define _PWM3PHL_PWM3PHL6_POSN                              0x6
#define _PWM3PHL_PWM3PHL6_POSITION                          0x6
#define _PWM3PHL_PWM3PHL6_SIZE                              0x1
#define _PWM3PHL_PWM3PHL6_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL6_MASK                              0x40
#define _PWM3PHL_PWM3PHL7_POSN                              0x7
#define _PWM3PHL_PWM3PHL7_POSITION                          0x7
#define _PWM3PHL_PWM3PHL7_SIZE                              0x1
#define _PWM3PHL_PWM3PHL7_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL7_MASK                              0x80
#define _PWM3PHL_PWM3PHL_POSN                               0x0
#define _PWM3PHL_PWM3PHL_POSITION                           0x0
#define _PWM3PHL_PWM3PHL_SIZE                               0x8
#define _PWM3PHL_PWM3PHL_LENGTH                             0x8
#define _PWM3PHL_PWM3PHL_MASK                               0xFF

// Register: PWM3PHH
#define PWM3PHH PWM3PHH
extern volatile unsigned char           PWM3PHH             __at(0xDB2);
#ifndef _LIB_BUILD
asm("PWM3PHH equ 0DB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM3PHH0               :1;
        unsigned PWM3PHH1               :1;
        unsigned PWM3PHH2               :1;
        unsigned PWM3PHH3               :1;
        unsigned PWM3PHH4               :1;
        unsigned PWM3PHH5               :1;
        unsigned PWM3PHH6               :1;
        unsigned PWM3PHH7               :1;
    };
    struct {
        unsigned PWM3PHH                :8;
    };
} PWM3PHHbits_t;
extern volatile PWM3PHHbits_t PWM3PHHbits __at(0xDB2);
// bitfield macros
#define _PWM3PHH_PH_POSN                                    0x0
#define _PWM3PHH_PH_POSITION                                0x0
#define _PWM3PHH_PH_SIZE                                    0x8
#define _PWM3PHH_PH_LENGTH                                  0x8
#define _PWM3PHH_PH_MASK                                    0xFF
#define _PWM3PHH_PWM3PHH0_POSN                              0x0
#define _PWM3PHH_PWM3PHH0_POSITION                          0x0
#define _PWM3PHH_PWM3PHH0_SIZE                              0x1
#define _PWM3PHH_PWM3PHH0_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH0_MASK                              0x1
#define _PWM3PHH_PWM3PHH1_POSN                              0x1
#define _PWM3PHH_PWM3PHH1_POSITION                          0x1
#define _PWM3PHH_PWM3PHH1_SIZE                              0x1
#define _PWM3PHH_PWM3PHH1_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH1_MASK                              0x2
#define _PWM3PHH_PWM3PHH2_POSN                              0x2
#define _PWM3PHH_PWM3PHH2_POSITION                          0x2
#define _PWM3PHH_PWM3PHH2_SIZE                              0x1
#define _PWM3PHH_PWM3PHH2_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH2_MASK                              0x4
#define _PWM3PHH_PWM3PHH3_POSN                              0x3
#define _PWM3PHH_PWM3PHH3_POSITION                          0x3
#define _PWM3PHH_PWM3PHH3_SIZE                              0x1
#define _PWM3PHH_PWM3PHH3_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH3_MASK                              0x8
#define _PWM3PHH_PWM3PHH4_POSN                              0x4
#define _PWM3PHH_PWM3PHH4_POSITION                          0x4
#define _PWM3PHH_PWM3PHH4_SIZE                              0x1
#define _PWM3PHH_PWM3PHH4_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH4_MASK                              0x10
#define _PWM3PHH_PWM3PHH5_POSN                              0x5
#define _PWM3PHH_PWM3PHH5_POSITION                          0x5
#define _PWM3PHH_PWM3PHH5_SIZE                              0x1
#define _PWM3PHH_PWM3PHH5_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH5_MASK                              0x20
#define _PWM3PHH_PWM3PHH6_POSN                              0x6
#define _PWM3PHH_PWM3PHH6_POSITION                          0x6
#define _PWM3PHH_PWM3PHH6_SIZE                              0x1
#define _PWM3PHH_PWM3PHH6_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH6_MASK                              0x40
#define _PWM3PHH_PWM3PHH7_POSN                              0x7
#define _PWM3PHH_PWM3PHH7_POSITION                          0x7
#define _PWM3PHH_PWM3PHH7_SIZE                              0x1
#define _PWM3PHH_PWM3PHH7_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH7_MASK                              0x80
#define _PWM3PHH_PWM3PHH_POSN                               0x0
#define _PWM3PHH_PWM3PHH_POSITION                           0x0
#define _PWM3PHH_PWM3PHH_SIZE                               0x8
#define _PWM3PHH_PWM3PHH_LENGTH                             0x8
#define _PWM3PHH_PWM3PHH_MASK                               0xFF

// Register: PWM3DC
#define PWM3DC PWM3DC
extern volatile unsigned short          PWM3DC              __at(0xDB3);
#ifndef _LIB_BUILD
asm("PWM3DC equ 0DB3h");
#endif

