MikroElektronika/core_packages/PIC/XC8/def/PIC16F1578/mcu.h
extern volatile PWM3INTEbits_t PWM3INTEbits __at(0xDBC);
// bitfield macros
#define _PWM3INTE_PRIE_POSN                                 0x0
#define _PWM3INTE_PRIE_POSITION                             0x0
#define _PWM3INTE_PRIE_SIZE                                 0x1
#define _PWM3INTE_PRIE_LENGTH                               0x1
#define _PWM3INTE_PRIE_MASK                                 0x1
#define _PWM3INTE_DCIE_POSN                                 0x1
#define _PWM3INTE_DCIE_POSITION                             0x1
#define _PWM3INTE_DCIE_SIZE                                 0x1
#define _PWM3INTE_DCIE_LENGTH                               0x1
#define _PWM3INTE_DCIE_MASK                                 0x2
#define _PWM3INTE_PHIE_POSN                                 0x2
#define _PWM3INTE_PHIE_POSITION                             0x2
#define _PWM3INTE_PHIE_SIZE                                 0x1
#define _PWM3INTE_PHIE_LENGTH                               0x1
#define _PWM3INTE_PHIE_MASK                                 0x4
#define _PWM3INTE_OFIE_POSN                                 0x3
#define _PWM3INTE_OFIE_POSITION                             0x3
#define _PWM3INTE_OFIE_SIZE                                 0x1
#define _PWM3INTE_OFIE_LENGTH                               0x1
#define _PWM3INTE_OFIE_MASK                                 0x8
#define _PWM3INTE_PWM3PRIE_POSN                             0x0
#define _PWM3INTE_PWM3PRIE_POSITION                         0x0
#define _PWM3INTE_PWM3PRIE_SIZE                             0x1
#define _PWM3INTE_PWM3PRIE_LENGTH                           0x1
#define _PWM3INTE_PWM3PRIE_MASK                             0x1
#define _PWM3INTE_PWM3DCIE_POSN                             0x1
#define _PWM3INTE_PWM3DCIE_POSITION                         0x1
#define _PWM3INTE_PWM3DCIE_SIZE                             0x1
#define _PWM3INTE_PWM3DCIE_LENGTH                           0x1
#define _PWM3INTE_PWM3DCIE_MASK                             0x2
#define _PWM3INTE_PWM3PHIE_POSN                             0x2
#define _PWM3INTE_PWM3PHIE_POSITION                         0x2
#define _PWM3INTE_PWM3PHIE_SIZE                             0x1
#define _PWM3INTE_PWM3PHIE_LENGTH                           0x1
#define _PWM3INTE_PWM3PHIE_MASK                             0x4
#define _PWM3INTE_PWM3OFIE_POSN                             0x3
#define _PWM3INTE_PWM3OFIE_POSITION                         0x3
#define _PWM3INTE_PWM3OFIE_SIZE                             0x1
#define _PWM3INTE_PWM3OFIE_LENGTH                           0x1
#define _PWM3INTE_PWM3OFIE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM3PRIE               :1;
        unsigned PWM3DCIE               :1;
        unsigned PWM3PHIE               :1;
        unsigned PWM3OFIE               :1;
    };
} PWM3INTCONbits_t;
extern volatile PWM3INTCONbits_t PWM3INTCONbits __at(0xDBC);
// bitfield macros
#define _PWM3INTCON_PRIE_POSN                               0x0
#define _PWM3INTCON_PRIE_POSITION                           0x0
#define _PWM3INTCON_PRIE_SIZE                               0x1
#define _PWM3INTCON_PRIE_LENGTH                             0x1
#define _PWM3INTCON_PRIE_MASK                               0x1
#define _PWM3INTCON_DCIE_POSN                               0x1
#define _PWM3INTCON_DCIE_POSITION                           0x1
#define _PWM3INTCON_DCIE_SIZE                               0x1
#define _PWM3INTCON_DCIE_LENGTH                             0x1
#define _PWM3INTCON_DCIE_MASK                               0x2
#define _PWM3INTCON_PHIE_POSN                               0x2
#define _PWM3INTCON_PHIE_POSITION                           0x2
#define _PWM3INTCON_PHIE_SIZE                               0x1
#define _PWM3INTCON_PHIE_LENGTH                             0x1
#define _PWM3INTCON_PHIE_MASK                               0x4
#define _PWM3INTCON_OFIE_POSN                               0x3
#define _PWM3INTCON_OFIE_POSITION                           0x3
#define _PWM3INTCON_OFIE_SIZE                               0x1
#define _PWM3INTCON_OFIE_LENGTH                             0x1
#define _PWM3INTCON_OFIE_MASK                               0x8
#define _PWM3INTCON_PWM3PRIE_POSN                           0x0
#define _PWM3INTCON_PWM3PRIE_POSITION                       0x0
#define _PWM3INTCON_PWM3PRIE_SIZE                           0x1
#define _PWM3INTCON_PWM3PRIE_LENGTH                         0x1
#define _PWM3INTCON_PWM3PRIE_MASK                           0x1
#define _PWM3INTCON_PWM3DCIE_POSN                           0x1
#define _PWM3INTCON_PWM3DCIE_POSITION                       0x1
#define _PWM3INTCON_PWM3DCIE_SIZE                           0x1
#define _PWM3INTCON_PWM3DCIE_LENGTH                         0x1
#define _PWM3INTCON_PWM3DCIE_MASK                           0x2
#define _PWM3INTCON_PWM3PHIE_POSN                           0x2
#define _PWM3INTCON_PWM3PHIE_POSITION                       0x2
#define _PWM3INTCON_PWM3PHIE_SIZE                           0x1
#define _PWM3INTCON_PWM3PHIE_LENGTH                         0x1
#define _PWM3INTCON_PWM3PHIE_MASK                           0x4
#define _PWM3INTCON_PWM3OFIE_POSN                           0x3
#define _PWM3INTCON_PWM3OFIE_POSITION                       0x3
#define _PWM3INTCON_PWM3OFIE_SIZE                           0x1
#define _PWM3INTCON_PWM3OFIE_LENGTH                         0x1
#define _PWM3INTCON_PWM3OFIE_MASK                           0x8

// Register: PWM3INTF
#define PWM3INTF PWM3INTF
extern volatile unsigned char           PWM3INTF            __at(0xDBD);
#ifndef _LIB_BUILD
asm("PWM3INTF equ 0DBDh");
#endif
// aliases
extern volatile unsigned char           PWM3INTFLG          __at(0xDBD);
#ifndef _LIB_BUILD
asm("PWM3INTFLG equ 0DBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM3PRIF               :1;
        unsigned PWM3DCIF               :1;
        unsigned PWM3PHIF               :1;
        unsigned PWM3OFIF               :1;
    };
} PWM3INTFbits_t;
extern volatile PWM3INTFbits_t PWM3INTFbits __at(0xDBD);
// bitfield macros
#define _PWM3INTF_PRIF_POSN                                 0x0
#define _PWM3INTF_PRIF_POSITION                             0x0
#define _PWM3INTF_PRIF_SIZE                                 0x1
#define _PWM3INTF_PRIF_LENGTH                               0x1
#define _PWM3INTF_PRIF_MASK                                 0x1
#define _PWM3INTF_DCIF_POSN                                 0x1
#define _PWM3INTF_DCIF_POSITION                             0x1
#define _PWM3INTF_DCIF_SIZE                                 0x1
#define _PWM3INTF_DCIF_LENGTH                               0x1
#define _PWM3INTF_DCIF_MASK                                 0x2
#define _PWM3INTF_PHIF_POSN                                 0x2
#define _PWM3INTF_PHIF_POSITION                             0x2
#define _PWM3INTF_PHIF_SIZE                                 0x1
#define _PWM3INTF_PHIF_LENGTH                               0x1
#define _PWM3INTF_PHIF_MASK                                 0x4
#define _PWM3INTF_OFIF_POSN                                 0x3
#define _PWM3INTF_OFIF_POSITION                             0x3
#define _PWM3INTF_OFIF_SIZE                                 0x1
#define _PWM3INTF_OFIF_LENGTH                               0x1
#define _PWM3INTF_OFIF_MASK                                 0x8
#define _PWM3INTF_PWM3PRIF_POSN                             0x0
#define _PWM3INTF_PWM3PRIF_POSITION                         0x0
#define _PWM3INTF_PWM3PRIF_SIZE                             0x1
#define _PWM3INTF_PWM3PRIF_LENGTH                           0x1
#define _PWM3INTF_PWM3PRIF_MASK                             0x1
#define _PWM3INTF_PWM3DCIF_POSN                             0x1
#define _PWM3INTF_PWM3DCIF_POSITION                         0x1
#define _PWM3INTF_PWM3DCIF_SIZE                             0x1
#define _PWM3INTF_PWM3DCIF_LENGTH                           0x1
#define _PWM3INTF_PWM3DCIF_MASK                             0x2
#define _PWM3INTF_PWM3PHIF_POSN                             0x2
#define _PWM3INTF_PWM3PHIF_POSITION                         0x2
#define _PWM3INTF_PWM3PHIF_SIZE                             0x1
#define _PWM3INTF_PWM3PHIF_LENGTH                           0x1
#define _PWM3INTF_PWM3PHIF_MASK                             0x4
#define _PWM3INTF_PWM3OFIF_POSN                             0x3
#define _PWM3INTF_PWM3OFIF_POSITION                         0x3
#define _PWM3INTF_PWM3OFIF_SIZE                             0x1
#define _PWM3INTF_PWM3OFIF_LENGTH                           0x1
#define _PWM3INTF_PWM3OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM3PRIF               :1;
        unsigned PWM3DCIF               :1;
        unsigned PWM3PHIF               :1;
        unsigned PWM3OFIF               :1;
    };
} PWM3INTFLGbits_t;
extern volatile PWM3INTFLGbits_t PWM3INTFLGbits __at(0xDBD);
// bitfield macros
#define _PWM3INTFLG_PRIF_POSN                               0x0
#define _PWM3INTFLG_PRIF_POSITION                           0x0
#define _PWM3INTFLG_PRIF_SIZE                               0x1
#define _PWM3INTFLG_PRIF_LENGTH                             0x1
#define _PWM3INTFLG_PRIF_MASK                               0x1
#define _PWM3INTFLG_DCIF_POSN                               0x1
#define _PWM3INTFLG_DCIF_POSITION                           0x1
#define _PWM3INTFLG_DCIF_SIZE                               0x1
#define _PWM3INTFLG_DCIF_LENGTH                             0x1
#define _PWM3INTFLG_DCIF_MASK                               0x2
#define _PWM3INTFLG_PHIF_POSN                               0x2
#define _PWM3INTFLG_PHIF_POSITION                           0x2
#define _PWM3INTFLG_PHIF_SIZE                               0x1
#define _PWM3INTFLG_PHIF_LENGTH                             0x1
#define _PWM3INTFLG_PHIF_MASK                               0x4
#define _PWM3INTFLG_OFIF_POSN                               0x3
#define _PWM3INTFLG_OFIF_POSITION                           0x3
#define _PWM3INTFLG_OFIF_SIZE                               0x1
#define _PWM3INTFLG_OFIF_LENGTH                             0x1
#define _PWM3INTFLG_OFIF_MASK                               0x8
#define _PWM3INTFLG_PWM3PRIF_POSN                           0x0
#define _PWM3INTFLG_PWM3PRIF_POSITION                       0x0
#define _PWM3INTFLG_PWM3PRIF_SIZE                           0x1
#define _PWM3INTFLG_PWM3PRIF_LENGTH                         0x1
#define _PWM3INTFLG_PWM3PRIF_MASK                           0x1
#define _PWM3INTFLG_PWM3DCIF_POSN                           0x1
#define _PWM3INTFLG_PWM3DCIF_POSITION                       0x1
#define _PWM3INTFLG_PWM3DCIF_SIZE                           0x1
#define _PWM3INTFLG_PWM3DCIF_LENGTH                         0x1
#define _PWM3INTFLG_PWM3DCIF_MASK                           0x2
#define _PWM3INTFLG_PWM3PHIF_POSN                           0x2
#define _PWM3INTFLG_PWM3PHIF_POSITION                       0x2
#define _PWM3INTFLG_PWM3PHIF_SIZE                           0x1
#define _PWM3INTFLG_PWM3PHIF_LENGTH                         0x1
#define _PWM3INTFLG_PWM3PHIF_MASK                           0x4
#define _PWM3INTFLG_PWM3OFIF_POSN                           0x3
#define _PWM3INTFLG_PWM3OFIF_POSITION                       0x3
#define _PWM3INTFLG_PWM3OFIF_SIZE                           0x1
#define _PWM3INTFLG_PWM3OFIF_LENGTH                         0x1
#define _PWM3INTFLG_PWM3OFIF_MASK                           0x8

// Register: PWM3CLKCON
#define PWM3CLKCON PWM3CLKCON
extern volatile unsigned char           PWM3CLKCON          __at(0xDBE);
#ifndef _LIB_BUILD
asm("PWM3CLKCON equ 0DBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM3CS0                :1;
        unsigned PWM3CS1                :1;
        unsigned                        :2;
        unsigned PWM3PS0                :1;
        unsigned PWM3PS1                :1;
        unsigned PWM3PS2                :1;
    };
    struct {
        unsigned PWM3CS                 :3;
        unsigned                        :1;
        unsigned PWM3PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned                        :2;
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
    };
} PWM3CLKCONbits_t;
extern volatile PWM3CLKCONbits_t PWM3CLKCONbits __at(0xDBE);
// bitfield macros
#define _PWM3CLKCON_CS_POSN                                 0x0
#define _PWM3CLKCON_CS_POSITION                             0x0
#define _PWM3CLKCON_CS_SIZE                                 0x2
#define _PWM3CLKCON_CS_LENGTH                               0x2
#define _PWM3CLKCON_CS_MASK                                 0x3
#define _PWM3CLKCON_PS_POSN                                 0x4
#define _PWM3CLKCON_PS_POSITION                             0x4
#define _PWM3CLKCON_PS_SIZE                                 0x3
#define _PWM3CLKCON_PS_LENGTH                               0x3
#define _PWM3CLKCON_PS_MASK                                 0x70
#define _PWM3CLKCON_PWM3CS0_POSN                            0x0
#define _PWM3CLKCON_PWM3CS0_POSITION                        0x0
#define _PWM3CLKCON_PWM3CS0_SIZE                            0x1
#define _PWM3CLKCON_PWM3CS0_LENGTH                          0x1
#define _PWM3CLKCON_PWM3CS0_MASK                            0x1
#define _PWM3CLKCON_PWM3CS1_POSN                            0x1
#define _PWM3CLKCON_PWM3CS1_POSITION                        0x1
#define _PWM3CLKCON_PWM3CS1_SIZE                            0x1
#define _PWM3CLKCON_PWM3CS1_LENGTH                          0x1
#define _PWM3CLKCON_PWM3CS1_MASK                            0x2
#define _PWM3CLKCON_PWM3PS0_POSN                            0x4
#define _PWM3CLKCON_PWM3PS0_POSITION                        0x4
#define _PWM3CLKCON_PWM3PS0_SIZE                            0x1
#define _PWM3CLKCON_PWM3PS0_LENGTH                          0x1
#define _PWM3CLKCON_PWM3PS0_MASK                            0x10
#define _PWM3CLKCON_PWM3PS1_POSN                            0x5
#define _PWM3CLKCON_PWM3PS1_POSITION                        0x5
#define _PWM3CLKCON_PWM3PS1_SIZE                            0x1
#define _PWM3CLKCON_PWM3PS1_LENGTH                          0x1
#define _PWM3CLKCON_PWM3PS1_MASK                            0x20
#define _PWM3CLKCON_PWM3PS2_POSN                            0x6
#define _PWM3CLKCON_PWM3PS2_POSITION                        0x6
#define _PWM3CLKCON_PWM3PS2_SIZE                            0x1
#define _PWM3CLKCON_PWM3PS2_LENGTH                          0x1
#define _PWM3CLKCON_PWM3PS2_MASK                            0x40
#define _PWM3CLKCON_PWM3CS_POSN                             0x0
#define _PWM3CLKCON_PWM3CS_POSITION                         0x0
#define _PWM3CLKCON_PWM3CS_SIZE                             0x3
#define _PWM3CLKCON_PWM3CS_LENGTH                           0x3
#define _PWM3CLKCON_PWM3CS_MASK                             0x7
#define _PWM3CLKCON_PWM3PS_POSN                             0x4
#define _PWM3CLKCON_PWM3PS_POSITION                         0x4
#define _PWM3CLKCON_PWM3PS_SIZE                             0x3
#define _PWM3CLKCON_PWM3PS_LENGTH                           0x3
#define _PWM3CLKCON_PWM3PS_MASK                             0x70
#define _PWM3CLKCON_CS0_POSN                                0x0
#define _PWM3CLKCON_CS0_POSITION                            0x0
#define _PWM3CLKCON_CS0_SIZE                                0x1
#define _PWM3CLKCON_CS0_LENGTH                              0x1
#define _PWM3CLKCON_CS0_MASK                                0x1
#define _PWM3CLKCON_CS1_POSN                                0x1
#define _PWM3CLKCON_CS1_POSITION                            0x1
#define _PWM3CLKCON_CS1_SIZE                                0x1
#define _PWM3CLKCON_CS1_LENGTH                              0x1
#define _PWM3CLKCON_CS1_MASK                                0x2
#define _PWM3CLKCON_PS0_POSN                                0x4
#define _PWM3CLKCON_PS0_POSITION                            0x4
#define _PWM3CLKCON_PS0_SIZE                                0x1
#define _PWM3CLKCON_PS0_LENGTH                              0x1
#define _PWM3CLKCON_PS0_MASK                                0x10
#define _PWM3CLKCON_PS1_POSN                                0x5
#define _PWM3CLKCON_PS1_POSITION                            0x5
#define _PWM3CLKCON_PS1_SIZE                                0x1
#define _PWM3CLKCON_PS1_LENGTH                              0x1
#define _PWM3CLKCON_PS1_MASK                                0x20
#define _PWM3CLKCON_PS2_POSN                                0x6
#define _PWM3CLKCON_PS2_POSITION                            0x6
#define _PWM3CLKCON_PS2_SIZE                                0x1
#define _PWM3CLKCON_PS2_LENGTH                              0x1
#define _PWM3CLKCON_PS2_MASK                                0x40

// Register: PWM3LDCON
#define PWM3LDCON PWM3LDCON
extern volatile unsigned char           PWM3LDCON           __at(0xDBF);
#ifndef _LIB_BUILD
asm("PWM3LDCON equ 0DBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM3LDS0               :1;
        unsigned PWM3LDS1               :1;
    };
    struct {
        unsigned PWM3LDS                :2;
        unsigned                        :4;
        unsigned PWM3LDM                :1;
        unsigned PWM3LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM3LDCONbits_t;
extern volatile PWM3LDCONbits_t PWM3LDCONbits __at(0xDBF);
// bitfield macros
#define _PWM3LDCON_LDS_POSN                                 0x0
#define _PWM3LDCON_LDS_POSITION                             0x0
#define _PWM3LDCON_LDS_SIZE                                 0x2
#define _PWM3LDCON_LDS_LENGTH                               0x2
#define _PWM3LDCON_LDS_MASK                                 0x3
#define _PWM3LDCON_LDT_POSN                                 0x6
#define _PWM3LDCON_LDT_POSITION                             0x6
#define _PWM3LDCON_LDT_SIZE                                 0x1
#define _PWM3LDCON_LDT_LENGTH                               0x1
#define _PWM3LDCON_LDT_MASK                                 0x40
#define _PWM3LDCON_LDA_POSN                                 0x7
#define _PWM3LDCON_LDA_POSITION                             0x7
#define _PWM3LDCON_LDA_SIZE                                 0x1
#define _PWM3LDCON_LDA_LENGTH                               0x1
#define _PWM3LDCON_LDA_MASK                                 0x80
#define _PWM3LDCON_PWM3LDS0_POSN                            0x0
#define _PWM3LDCON_PWM3LDS0_POSITION                        0x0
#define _PWM3LDCON_PWM3LDS0_SIZE                            0x1
#define _PWM3LDCON_PWM3LDS0_LENGTH                          0x1
#define _PWM3LDCON_PWM3LDS0_MASK                            0x1
#define _PWM3LDCON_PWM3LDS1_POSN                            0x1
#define _PWM3LDCON_PWM3LDS1_POSITION                        0x1
#define _PWM3LDCON_PWM3LDS1_SIZE                            0x1
#define _PWM3LDCON_PWM3LDS1_LENGTH                          0x1
#define _PWM3LDCON_PWM3LDS1_MASK                            0x2
#define _PWM3LDCON_PWM3LDS_POSN                             0x0
#define _PWM3LDCON_PWM3LDS_POSITION                         0x0
#define _PWM3LDCON_PWM3LDS_SIZE                             0x2
#define _PWM3LDCON_PWM3LDS_LENGTH                           0x2
#define _PWM3LDCON_PWM3LDS_MASK                             0x3
#define _PWM3LDCON_PWM3LDM_POSN                             0x6
#define _PWM3LDCON_PWM3LDM_POSITION                         0x6
#define _PWM3LDCON_PWM3LDM_SIZE                             0x1
#define _PWM3LDCON_PWM3LDM_LENGTH                           0x1
#define _PWM3LDCON_PWM3LDM_MASK                             0x40
#define _PWM3LDCON_PWM3LD_POSN                              0x7
#define _PWM3LDCON_PWM3LD_POSITION                          0x7
#define _PWM3LDCON_PWM3LD_SIZE                              0x1
#define _PWM3LDCON_PWM3LD_LENGTH                            0x1
#define _PWM3LDCON_PWM3LD_MASK                              0x80
#define _PWM3LDCON_LDS0_POSN                                0x0
#define _PWM3LDCON_LDS0_POSITION                            0x0
#define _PWM3LDCON_LDS0_SIZE                                0x1
#define _PWM3LDCON_LDS0_LENGTH                              0x1
#define _PWM3LDCON_LDS0_MASK                                0x1
#define _PWM3LDCON_LDS1_POSN                                0x1
#define _PWM3LDCON_LDS1_POSITION                            0x1
#define _PWM3LDCON_LDS1_SIZE                                0x1
#define _PWM3LDCON_LDS1_LENGTH                              0x1
#define _PWM3LDCON_LDS1_MASK                                0x2

// Register: PWM3OFCON
#define PWM3OFCON PWM3OFCON
extern volatile unsigned char           PWM3OFCON           __at(0xDC0);
#ifndef _LIB_BUILD
asm("PWM3OFCON equ 0DC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM3OFS0               :1;
        unsigned PWM3OFS1               :1;
        unsigned                        :3;
        unsigned PWM3OFM0               :1;
        unsigned PWM3OFM1               :1;
    };
    struct {
        unsigned PWM3OFS                :2;
        unsigned                        :2;
        unsigned PWM3OFMC               :1;
        unsigned PWM3OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM3OFCONbits_t;
