MikroElektronika/core_packages/PIC/XC8/def/PIC16F1578/mcu.h
// Register: PWM4OFH
#define PWM4OFH PWM4OFH
extern volatile unsigned char           PWM4OFH             __at(0xDC8);
#ifndef _LIB_BUILD
asm("PWM4OFH equ 0DC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM4OFH0               :1;
        unsigned PWM4OFH1               :1;
        unsigned PWM4OFH2               :1;
        unsigned PWM4OFH3               :1;
        unsigned PWM4OFH4               :1;
        unsigned PWM4OFH5               :1;
        unsigned PWM4OFH6               :1;
        unsigned PWM4OFH7               :1;
    };
    struct {
        unsigned PWM4OFH                :8;
    };
} PWM4OFHbits_t;
extern volatile PWM4OFHbits_t PWM4OFHbits __at(0xDC8);
// bitfield macros
#define _PWM4OFH_OF_POSN                                    0x0
#define _PWM4OFH_OF_POSITION                                0x0
#define _PWM4OFH_OF_SIZE                                    0x8
#define _PWM4OFH_OF_LENGTH                                  0x8
#define _PWM4OFH_OF_MASK                                    0xFF
#define _PWM4OFH_PWM4OFH0_POSN                              0x0
#define _PWM4OFH_PWM4OFH0_POSITION                          0x0
#define _PWM4OFH_PWM4OFH0_SIZE                              0x1
#define _PWM4OFH_PWM4OFH0_LENGTH                            0x1
#define _PWM4OFH_PWM4OFH0_MASK                              0x1
#define _PWM4OFH_PWM4OFH1_POSN                              0x1
#define _PWM4OFH_PWM4OFH1_POSITION                          0x1
#define _PWM4OFH_PWM4OFH1_SIZE                              0x1
#define _PWM4OFH_PWM4OFH1_LENGTH                            0x1
#define _PWM4OFH_PWM4OFH1_MASK                              0x2
#define _PWM4OFH_PWM4OFH2_POSN                              0x2
#define _PWM4OFH_PWM4OFH2_POSITION                          0x2
#define _PWM4OFH_PWM4OFH2_SIZE                              0x1
#define _PWM4OFH_PWM4OFH2_LENGTH                            0x1
#define _PWM4OFH_PWM4OFH2_MASK                              0x4
#define _PWM4OFH_PWM4OFH3_POSN                              0x3
#define _PWM4OFH_PWM4OFH3_POSITION                          0x3
#define _PWM4OFH_PWM4OFH3_SIZE                              0x1
#define _PWM4OFH_PWM4OFH3_LENGTH                            0x1
#define _PWM4OFH_PWM4OFH3_MASK                              0x8
#define _PWM4OFH_PWM4OFH4_POSN                              0x4
#define _PWM4OFH_PWM4OFH4_POSITION                          0x4
#define _PWM4OFH_PWM4OFH4_SIZE                              0x1
#define _PWM4OFH_PWM4OFH4_LENGTH                            0x1
#define _PWM4OFH_PWM4OFH4_MASK                              0x10
#define _PWM4OFH_PWM4OFH5_POSN                              0x5
#define _PWM4OFH_PWM4OFH5_POSITION                          0x5
#define _PWM4OFH_PWM4OFH5_SIZE                              0x1
#define _PWM4OFH_PWM4OFH5_LENGTH                            0x1
#define _PWM4OFH_PWM4OFH5_MASK                              0x20
#define _PWM4OFH_PWM4OFH6_POSN                              0x6
#define _PWM4OFH_PWM4OFH6_POSITION                          0x6
#define _PWM4OFH_PWM4OFH6_SIZE                              0x1
#define _PWM4OFH_PWM4OFH6_LENGTH                            0x1
#define _PWM4OFH_PWM4OFH6_MASK                              0x40
#define _PWM4OFH_PWM4OFH7_POSN                              0x7
#define _PWM4OFH_PWM4OFH7_POSITION                          0x7
#define _PWM4OFH_PWM4OFH7_SIZE                              0x1
#define _PWM4OFH_PWM4OFH7_LENGTH                            0x1
#define _PWM4OFH_PWM4OFH7_MASK                              0x80
#define _PWM4OFH_PWM4OFH_POSN                               0x0
#define _PWM4OFH_PWM4OFH_POSITION                           0x0
#define _PWM4OFH_PWM4OFH_SIZE                               0x8
#define _PWM4OFH_PWM4OFH_LENGTH                             0x8
#define _PWM4OFH_PWM4OFH_MASK                               0xFF

// Register: PWM4TMR
#define PWM4TMR PWM4TMR
extern volatile unsigned short          PWM4TMR             __at(0xDC9);
#ifndef _LIB_BUILD
asm("PWM4TMR equ 0DC9h");
#endif

// Register: PWM4TMRL
#define PWM4TMRL PWM4TMRL
extern volatile unsigned char           PWM4TMRL            __at(0xDC9);
#ifndef _LIB_BUILD
asm("PWM4TMRL equ 0DC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM4TMRL0              :1;
        unsigned PWM4TMRL1              :1;
        unsigned PWM4TMRL2              :1;
        unsigned PWM4TMRL3              :1;
        unsigned PWM4TMRL4              :1;
        unsigned PWM4TMRL5              :1;
        unsigned PWM4TMRL6              :1;
        unsigned PWM4TMRL7              :1;
    };
    struct {
        unsigned PWM4TMRL               :8;
    };
} PWM4TMRLbits_t;
extern volatile PWM4TMRLbits_t PWM4TMRLbits __at(0xDC9);
// bitfield macros
#define _PWM4TMRL_TMR_POSN                                  0x0
#define _PWM4TMRL_TMR_POSITION                              0x0
#define _PWM4TMRL_TMR_SIZE                                  0x8
#define _PWM4TMRL_TMR_LENGTH                                0x8
#define _PWM4TMRL_TMR_MASK                                  0xFF
#define _PWM4TMRL_PWM4TMRL0_POSN                            0x0
#define _PWM4TMRL_PWM4TMRL0_POSITION                        0x0
#define _PWM4TMRL_PWM4TMRL0_SIZE                            0x1
#define _PWM4TMRL_PWM4TMRL0_LENGTH                          0x1
#define _PWM4TMRL_PWM4TMRL0_MASK                            0x1
#define _PWM4TMRL_PWM4TMRL1_POSN                            0x1
#define _PWM4TMRL_PWM4TMRL1_POSITION                        0x1
#define _PWM4TMRL_PWM4TMRL1_SIZE                            0x1
#define _PWM4TMRL_PWM4TMRL1_LENGTH                          0x1
#define _PWM4TMRL_PWM4TMRL1_MASK                            0x2
#define _PWM4TMRL_PWM4TMRL2_POSN                            0x2
#define _PWM4TMRL_PWM4TMRL2_POSITION                        0x2
#define _PWM4TMRL_PWM4TMRL2_SIZE                            0x1
#define _PWM4TMRL_PWM4TMRL2_LENGTH                          0x1
#define _PWM4TMRL_PWM4TMRL2_MASK                            0x4
#define _PWM4TMRL_PWM4TMRL3_POSN                            0x3
#define _PWM4TMRL_PWM4TMRL3_POSITION                        0x3
#define _PWM4TMRL_PWM4TMRL3_SIZE                            0x1
#define _PWM4TMRL_PWM4TMRL3_LENGTH                          0x1
#define _PWM4TMRL_PWM4TMRL3_MASK                            0x8
#define _PWM4TMRL_PWM4TMRL4_POSN                            0x4
#define _PWM4TMRL_PWM4TMRL4_POSITION                        0x4
#define _PWM4TMRL_PWM4TMRL4_SIZE                            0x1
#define _PWM4TMRL_PWM4TMRL4_LENGTH                          0x1
#define _PWM4TMRL_PWM4TMRL4_MASK                            0x10
#define _PWM4TMRL_PWM4TMRL5_POSN                            0x5
#define _PWM4TMRL_PWM4TMRL5_POSITION                        0x5
#define _PWM4TMRL_PWM4TMRL5_SIZE                            0x1
#define _PWM4TMRL_PWM4TMRL5_LENGTH                          0x1
#define _PWM4TMRL_PWM4TMRL5_MASK                            0x20
#define _PWM4TMRL_PWM4TMRL6_POSN                            0x6
#define _PWM4TMRL_PWM4TMRL6_POSITION                        0x6
#define _PWM4TMRL_PWM4TMRL6_SIZE                            0x1
#define _PWM4TMRL_PWM4TMRL6_LENGTH                          0x1
#define _PWM4TMRL_PWM4TMRL6_MASK                            0x40
#define _PWM4TMRL_PWM4TMRL7_POSN                            0x7
#define _PWM4TMRL_PWM4TMRL7_POSITION                        0x7
#define _PWM4TMRL_PWM4TMRL7_SIZE                            0x1
#define _PWM4TMRL_PWM4TMRL7_LENGTH                          0x1
#define _PWM4TMRL_PWM4TMRL7_MASK                            0x80
#define _PWM4TMRL_PWM4TMRL_POSN                             0x0
#define _PWM4TMRL_PWM4TMRL_POSITION                         0x0
#define _PWM4TMRL_PWM4TMRL_SIZE                             0x8
#define _PWM4TMRL_PWM4TMRL_LENGTH                           0x8
#define _PWM4TMRL_PWM4TMRL_MASK                             0xFF

// Register: PWM4TMRH
#define PWM4TMRH PWM4TMRH
extern volatile unsigned char           PWM4TMRH            __at(0xDCA);
#ifndef _LIB_BUILD
asm("PWM4TMRH equ 0DCAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM4TMRH0              :1;
        unsigned PWM4TMRH1              :1;
        unsigned PWM4TMRH2              :1;
        unsigned PWM4TMRH3              :1;
        unsigned PWM4TMRH4              :1;
        unsigned PWM4TMRH5              :1;
        unsigned PWM4TMRH6              :1;
        unsigned PWM4TMRH7              :1;
    };
    struct {
        unsigned PWM4TMRH               :8;
    };
} PWM4TMRHbits_t;
extern volatile PWM4TMRHbits_t PWM4TMRHbits __at(0xDCA);
// bitfield macros
#define _PWM4TMRH_TMR_POSN                                  0x0
#define _PWM4TMRH_TMR_POSITION                              0x0
#define _PWM4TMRH_TMR_SIZE                                  0x8
#define _PWM4TMRH_TMR_LENGTH                                0x8
#define _PWM4TMRH_TMR_MASK                                  0xFF
#define _PWM4TMRH_PWM4TMRH0_POSN                            0x0
#define _PWM4TMRH_PWM4TMRH0_POSITION                        0x0
#define _PWM4TMRH_PWM4TMRH0_SIZE                            0x1
#define _PWM4TMRH_PWM4TMRH0_LENGTH                          0x1
#define _PWM4TMRH_PWM4TMRH0_MASK                            0x1
#define _PWM4TMRH_PWM4TMRH1_POSN                            0x1
#define _PWM4TMRH_PWM4TMRH1_POSITION                        0x1
#define _PWM4TMRH_PWM4TMRH1_SIZE                            0x1
#define _PWM4TMRH_PWM4TMRH1_LENGTH                          0x1
#define _PWM4TMRH_PWM4TMRH1_MASK                            0x2
#define _PWM4TMRH_PWM4TMRH2_POSN                            0x2
#define _PWM4TMRH_PWM4TMRH2_POSITION                        0x2
#define _PWM4TMRH_PWM4TMRH2_SIZE                            0x1
#define _PWM4TMRH_PWM4TMRH2_LENGTH                          0x1
#define _PWM4TMRH_PWM4TMRH2_MASK                            0x4
#define _PWM4TMRH_PWM4TMRH3_POSN                            0x3
#define _PWM4TMRH_PWM4TMRH3_POSITION                        0x3
#define _PWM4TMRH_PWM4TMRH3_SIZE                            0x1
#define _PWM4TMRH_PWM4TMRH3_LENGTH                          0x1
#define _PWM4TMRH_PWM4TMRH3_MASK                            0x8
#define _PWM4TMRH_PWM4TMRH4_POSN                            0x4
#define _PWM4TMRH_PWM4TMRH4_POSITION                        0x4
#define _PWM4TMRH_PWM4TMRH4_SIZE                            0x1
#define _PWM4TMRH_PWM4TMRH4_LENGTH                          0x1
#define _PWM4TMRH_PWM4TMRH4_MASK                            0x10
#define _PWM4TMRH_PWM4TMRH5_POSN                            0x5
#define _PWM4TMRH_PWM4TMRH5_POSITION                        0x5
#define _PWM4TMRH_PWM4TMRH5_SIZE                            0x1
#define _PWM4TMRH_PWM4TMRH5_LENGTH                          0x1
#define _PWM4TMRH_PWM4TMRH5_MASK                            0x20
#define _PWM4TMRH_PWM4TMRH6_POSN                            0x6
#define _PWM4TMRH_PWM4TMRH6_POSITION                        0x6
#define _PWM4TMRH_PWM4TMRH6_SIZE                            0x1
#define _PWM4TMRH_PWM4TMRH6_LENGTH                          0x1
#define _PWM4TMRH_PWM4TMRH6_MASK                            0x40
#define _PWM4TMRH_PWM4TMRH7_POSN                            0x7
#define _PWM4TMRH_PWM4TMRH7_POSITION                        0x7
#define _PWM4TMRH_PWM4TMRH7_SIZE                            0x1
#define _PWM4TMRH_PWM4TMRH7_LENGTH                          0x1
#define _PWM4TMRH_PWM4TMRH7_MASK                            0x80
#define _PWM4TMRH_PWM4TMRH_POSN                             0x0
#define _PWM4TMRH_PWM4TMRH_POSITION                         0x0
#define _PWM4TMRH_PWM4TMRH_SIZE                             0x8
#define _PWM4TMRH_PWM4TMRH_LENGTH                           0x8
#define _PWM4TMRH_PWM4TMRH_MASK                             0xFF

