MikroElektronika/core_packages/PIC/XC8/def/PIC16F1578/mcu.h
#define                                 PWM3PRL7_bit        _BIT_ACCESS(PWM3PRL,7)
// PWM3CLKCON<PWM3PS0>
extern volatile __bit                   PWM3PS0             __at(0x6DF4);	// @ (0xDBE * 8 + 4)
#define                                 PWM3PS0_bit         _BIT_ACCESS(PWM3CLKCON,4)
// PWM3CLKCON<PWM3PS1>
extern volatile __bit                   PWM3PS1             __at(0x6DF5);	// @ (0xDBE * 8 + 5)
#define                                 PWM3PS1_bit         _BIT_ACCESS(PWM3CLKCON,5)
// PWM3CLKCON<PWM3PS2>
extern volatile __bit                   PWM3PS2             __at(0x6DF6);	// @ (0xDBE * 8 + 6)
#define                                 PWM3PS2_bit         _BIT_ACCESS(PWM3CLKCON,6)
// PWM3TMRH<PWM3TMRH0>
extern volatile __bit                   PWM3TMRH0           __at(0x6DD0);	// @ (0xDBA * 8 + 0)
#define                                 PWM3TMRH0_bit       _BIT_ACCESS(PWM3TMRH,0)
// PWM3TMRH<PWM3TMRH1>
extern volatile __bit                   PWM3TMRH1           __at(0x6DD1);	// @ (0xDBA * 8 + 1)
#define                                 PWM3TMRH1_bit       _BIT_ACCESS(PWM3TMRH,1)
// PWM3TMRH<PWM3TMRH2>
extern volatile __bit                   PWM3TMRH2           __at(0x6DD2);	// @ (0xDBA * 8 + 2)
#define                                 PWM3TMRH2_bit       _BIT_ACCESS(PWM3TMRH,2)
// PWM3TMRH<PWM3TMRH3>
extern volatile __bit                   PWM3TMRH3           __at(0x6DD3);	// @ (0xDBA * 8 + 3)
#define                                 PWM3TMRH3_bit       _BIT_ACCESS(PWM3TMRH,3)
// PWM3TMRH<PWM3TMRH4>
extern volatile __bit                   PWM3TMRH4           __at(0x6DD4);	// @ (0xDBA * 8 + 4)
#define                                 PWM3TMRH4_bit       _BIT_ACCESS(PWM3TMRH,4)
// PWM3TMRH<PWM3TMRH5>
extern volatile __bit                   PWM3TMRH5           __at(0x6DD5);	// @ (0xDBA * 8 + 5)
#define                                 PWM3TMRH5_bit       _BIT_ACCESS(PWM3TMRH,5)
// PWM3TMRH<PWM3TMRH6>
extern volatile __bit                   PWM3TMRH6           __at(0x6DD6);	// @ (0xDBA * 8 + 6)
#define                                 PWM3TMRH6_bit       _BIT_ACCESS(PWM3TMRH,6)
// PWM3TMRH<PWM3TMRH7>
extern volatile __bit                   PWM3TMRH7           __at(0x6DD7);	// @ (0xDBA * 8 + 7)
#define                                 PWM3TMRH7_bit       _BIT_ACCESS(PWM3TMRH,7)
// PWM3TMRL<PWM3TMRL0>
extern volatile __bit                   PWM3TMRL0           __at(0x6DC8);	// @ (0xDB9 * 8 + 0)
#define                                 PWM3TMRL0_bit       _BIT_ACCESS(PWM3TMRL,0)
// PWM3TMRL<PWM3TMRL1>
extern volatile __bit                   PWM3TMRL1           __at(0x6DC9);	// @ (0xDB9 * 8 + 1)
#define                                 PWM3TMRL1_bit       _BIT_ACCESS(PWM3TMRL,1)
// PWM3TMRL<PWM3TMRL2>
extern volatile __bit                   PWM3TMRL2           __at(0x6DCA);	// @ (0xDB9 * 8 + 2)
#define                                 PWM3TMRL2_bit       _BIT_ACCESS(PWM3TMRL,2)
// PWM3TMRL<PWM3TMRL3>
extern volatile __bit                   PWM3TMRL3           __at(0x6DCB);	// @ (0xDB9 * 8 + 3)
#define                                 PWM3TMRL3_bit       _BIT_ACCESS(PWM3TMRL,3)
// PWM3TMRL<PWM3TMRL4>
extern volatile __bit                   PWM3TMRL4           __at(0x6DCC);	// @ (0xDB9 * 8 + 4)
#define                                 PWM3TMRL4_bit       _BIT_ACCESS(PWM3TMRL,4)
// PWM3TMRL<PWM3TMRL5>
extern volatile __bit                   PWM3TMRL5           __at(0x6DCD);	// @ (0xDB9 * 8 + 5)
#define                                 PWM3TMRL5_bit       _BIT_ACCESS(PWM3TMRL,5)
// PWM3TMRL<PWM3TMRL6>
extern volatile __bit                   PWM3TMRL6           __at(0x6DCE);	// @ (0xDB9 * 8 + 6)
#define                                 PWM3TMRL6_bit       _BIT_ACCESS(PWM3TMRL,6)
// PWM3TMRL<PWM3TMRL7>
extern volatile __bit                   PWM3TMRL7           __at(0x6DCF);	// @ (0xDB9 * 8 + 7)
#define                                 PWM3TMRL7_bit       _BIT_ACCESS(PWM3TMRL,7)
// PWM4CLKCON<PWM4CS0>
extern volatile __bit                   PWM4CS0             __at(0x6E70);	// @ (0xDCE * 8 + 0)
#define                                 PWM4CS0_bit         _BIT_ACCESS(PWM4CLKCON,0)
// PWM4CLKCON<PWM4CS1>
extern volatile __bit                   PWM4CS1             __at(0x6E71);	// @ (0xDCE * 8 + 1)
#define                                 PWM4CS1_bit         _BIT_ACCESS(PWM4CLKCON,1)
// PWM4DCH<PWM4DCH0>
extern volatile __bit                   PWM4DCH0            __at(0x6E20);	// @ (0xDC4 * 8 + 0)
#define                                 PWM4DCH0_bit        _BIT_ACCESS(PWM4DCH,0)
// PWM4DCH<PWM4DCH1>
extern volatile __bit                   PWM4DCH1            __at(0x6E21);	// @ (0xDC4 * 8 + 1)
#define                                 PWM4DCH1_bit        _BIT_ACCESS(PWM4DCH,1)
// PWM4DCH<PWM4DCH2>
extern volatile __bit                   PWM4DCH2            __at(0x6E22);	// @ (0xDC4 * 8 + 2)
#define                                 PWM4DCH2_bit        _BIT_ACCESS(PWM4DCH,2)
// PWM4DCH<PWM4DCH3>
extern volatile __bit                   PWM4DCH3            __at(0x6E23);	// @ (0xDC4 * 8 + 3)
#define                                 PWM4DCH3_bit        _BIT_ACCESS(PWM4DCH,3)
// PWM4DCH<PWM4DCH4>
extern volatile __bit                   PWM4DCH4            __at(0x6E24);	// @ (0xDC4 * 8 + 4)
#define                                 PWM4DCH4_bit        _BIT_ACCESS(PWM4DCH,4)
// PWM4DCH<PWM4DCH5>
extern volatile __bit                   PWM4DCH5            __at(0x6E25);	// @ (0xDC4 * 8 + 5)
#define                                 PWM4DCH5_bit        _BIT_ACCESS(PWM4DCH,5)
// PWM4DCH<PWM4DCH6>
extern volatile __bit                   PWM4DCH6            __at(0x6E26);	// @ (0xDC4 * 8 + 6)
#define                                 PWM4DCH6_bit        _BIT_ACCESS(PWM4DCH,6)
// PWM4DCH<PWM4DCH7>
extern volatile __bit                   PWM4DCH7            __at(0x6E27);	// @ (0xDC4 * 8 + 7)
#define                                 PWM4DCH7_bit        _BIT_ACCESS(PWM4DCH,7)
// PWM4INTE<PWM4DCIE>
extern volatile __bit                   PWM4DCIE            __at(0x6E61);	// @ (0xDCC * 8 + 1)
#define                                 PWM4DCIE_bit        _BIT_ACCESS(PWM4INTE,1)
// PWM4INTF<PWM4DCIF>
extern volatile __bit                   PWM4DCIF            __at(0x6E69);	// @ (0xDCD * 8 + 1)
#define                                 PWM4DCIF_bit        _BIT_ACCESS(PWM4INTF,1)
// PWM4DCL<PWM4DCL0>
extern volatile __bit                   PWM4DCL0            __at(0x6E18);	// @ (0xDC3 * 8 + 0)
#define                                 PWM4DCL0_bit        _BIT_ACCESS(PWM4DCL,0)
// PWM4DCL<PWM4DCL1>
extern volatile __bit                   PWM4DCL1            __at(0x6E19);	// @ (0xDC3 * 8 + 1)
#define                                 PWM4DCL1_bit        _BIT_ACCESS(PWM4DCL,1)
// PWM4DCL<PWM4DCL2>
extern volatile __bit                   PWM4DCL2            __at(0x6E1A);	// @ (0xDC3 * 8 + 2)
#define                                 PWM4DCL2_bit        _BIT_ACCESS(PWM4DCL,2)
// PWM4DCL<PWM4DCL3>
extern volatile __bit                   PWM4DCL3            __at(0x6E1B);	// @ (0xDC3 * 8 + 3)
#define                                 PWM4DCL3_bit        _BIT_ACCESS(PWM4DCL,3)
// PWM4DCL<PWM4DCL4>
extern volatile __bit                   PWM4DCL4            __at(0x6E1C);	// @ (0xDC3 * 8 + 4)
#define                                 PWM4DCL4_bit        _BIT_ACCESS(PWM4DCL,4)
// PWM4DCL<PWM4DCL5>
extern volatile __bit                   PWM4DCL5            __at(0x6E1D);	// @ (0xDC3 * 8 + 5)
#define                                 PWM4DCL5_bit        _BIT_ACCESS(PWM4DCL,5)
// PWM4DCL<PWM4DCL6>
extern volatile __bit                   PWM4DCL6            __at(0x6E1E);	// @ (0xDC3 * 8 + 6)
#define                                 PWM4DCL6_bit        _BIT_ACCESS(PWM4DCL,6)
// PWM4DCL<PWM4DCL7>
extern volatile __bit                   PWM4DCL7            __at(0x6E1F);	// @ (0xDC3 * 8 + 7)
#define                                 PWM4DCL7_bit        _BIT_ACCESS(PWM4DCL,7)
// PWM4CON<PWM4EN>
extern volatile __bit                   PWM4EN              __at(0x6E5F);	// @ (0xDCB * 8 + 7)
#define                                 PWM4EN_bit          _BIT_ACCESS(PWM4CON,7)
// PWMEN<PWM4EN_A>
extern volatile __bit                   PWM4EN_A            __at(0x6C73);	// @ (0xD8E * 8 + 3)
#define                                 PWM4EN_A_bit        _BIT_ACCESS(PWMEN,3)
// PIE3<PWM4IE>
extern volatile __bit                   PWM4IE              __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 PWM4IE_bit          _BIT_ACCESS(PIE3,7)
// PIR3<PWM4IF>
extern volatile __bit                   PWM4IF              __at(0x9F);	// @ (0x13 * 8 + 7)
#define                                 PWM4IF_bit          _BIT_ACCESS(PIR3,7)
// PWM4LDCON<PWM4LD>
extern volatile __bit                   PWM4LD              __at(0x6E7F);	// @ (0xDCF * 8 + 7)
#define                                 PWM4LD_bit          _BIT_ACCESS(PWM4LDCON,7)
// PWMLD<PWM4LDA_A>
extern volatile __bit                   PWM4LDA_A           __at(0x6C7B);	// @ (0xD8F * 8 + 3)
#define                                 PWM4LDA_A_bit       _BIT_ACCESS(PWMLD,3)
// PWM4LDCON<PWM4LDM>
extern volatile __bit                   PWM4LDM             __at(0x6E7E);	// @ (0xDCF * 8 + 6)
#define                                 PWM4LDM_bit         _BIT_ACCESS(PWM4LDCON,6)
// PWM4LDCON<PWM4LDS0>
extern volatile __bit                   PWM4LDS0            __at(0x6E78);	// @ (0xDCF * 8 + 0)
#define                                 PWM4LDS0_bit        _BIT_ACCESS(PWM4LDCON,0)
// PWM4LDCON<PWM4LDS1>
extern volatile __bit                   PWM4LDS1            __at(0x6E79);	// @ (0xDCF * 8 + 1)
#define                                 PWM4LDS1_bit        _BIT_ACCESS(PWM4LDCON,1)
// PWM4CON<PWM4MODE0>
extern volatile __bit                   PWM4MODE0           __at(0x6E5A);	// @ (0xDCB * 8 + 2)
#define                                 PWM4MODE0_bit       _BIT_ACCESS(PWM4CON,2)
// PWM4CON<PWM4MODE1>
extern volatile __bit                   PWM4MODE1           __at(0x6E5B);	// @ (0xDCB * 8 + 3)
#define                                 PWM4MODE1_bit       _BIT_ACCESS(PWM4CON,3)
// PWM4CON<PWM4OE>
extern volatile __bit                   PWM4OE              __at(0x6E5E);	// @ (0xDCB * 8 + 6)
#define                                 PWM4OE_bit          _BIT_ACCESS(PWM4CON,6)
// PWM4OFH<PWM4OFH0>
extern volatile __bit                   PWM4OFH0            __at(0x6E40);	// @ (0xDC8 * 8 + 0)
#define                                 PWM4OFH0_bit        _BIT_ACCESS(PWM4OFH,0)
// PWM4OFH<PWM4OFH1>
extern volatile __bit                   PWM4OFH1            __at(0x6E41);	// @ (0xDC8 * 8 + 1)
#define                                 PWM4OFH1_bit        _BIT_ACCESS(PWM4OFH,1)
// PWM4OFH<PWM4OFH2>
extern volatile __bit                   PWM4OFH2            __at(0x6E42);	// @ (0xDC8 * 8 + 2)
#define                                 PWM4OFH2_bit        _BIT_ACCESS(PWM4OFH,2)
// PWM4OFH<PWM4OFH3>
extern volatile __bit                   PWM4OFH3            __at(0x6E43);	// @ (0xDC8 * 8 + 3)
#define                                 PWM4OFH3_bit        _BIT_ACCESS(PWM4OFH,3)
// PWM4OFH<PWM4OFH4>
extern volatile __bit                   PWM4OFH4            __at(0x6E44);	// @ (0xDC8 * 8 + 4)
#define                                 PWM4OFH4_bit        _BIT_ACCESS(PWM4OFH,4)
// PWM4OFH<PWM4OFH5>
extern volatile __bit                   PWM4OFH5            __at(0x6E45);	// @ (0xDC8 * 8 + 5)
#define                                 PWM4OFH5_bit        _BIT_ACCESS(PWM4OFH,5)
// PWM4OFH<PWM4OFH6>
extern volatile __bit                   PWM4OFH6            __at(0x6E46);	// @ (0xDC8 * 8 + 6)
#define                                 PWM4OFH6_bit        _BIT_ACCESS(PWM4OFH,6)
// PWM4OFH<PWM4OFH7>
extern volatile __bit                   PWM4OFH7            __at(0x6E47);	// @ (0xDC8 * 8 + 7)
#define                                 PWM4OFH7_bit        _BIT_ACCESS(PWM4OFH,7)
// PWM4INTE<PWM4OFIE>
extern volatile __bit                   PWM4OFIE            __at(0x6E63);	// @ (0xDCC * 8 + 3)
#define                                 PWM4OFIE_bit        _BIT_ACCESS(PWM4INTE,3)
// PWM4INTF<PWM4OFIF>
extern volatile __bit                   PWM4OFIF            __at(0x6E6B);	// @ (0xDCD * 8 + 3)
#define                                 PWM4OFIF_bit        _BIT_ACCESS(PWM4INTF,3)
// PWM4OFL<PWM4OFL0>
extern volatile __bit                   PWM4OFL0            __at(0x6E38);	// @ (0xDC7 * 8 + 0)
#define                                 PWM4OFL0_bit        _BIT_ACCESS(PWM4OFL,0)
// PWM4OFL<PWM4OFL1>
extern volatile __bit                   PWM4OFL1            __at(0x6E39);	// @ (0xDC7 * 8 + 1)
#define                                 PWM4OFL1_bit        _BIT_ACCESS(PWM4OFL,1)
// PWM4OFL<PWM4OFL2>
extern volatile __bit                   PWM4OFL2            __at(0x6E3A);	// @ (0xDC7 * 8 + 2)
#define                                 PWM4OFL2_bit        _BIT_ACCESS(PWM4OFL,2)
// PWM4OFL<PWM4OFL3>
extern volatile __bit                   PWM4OFL3            __at(0x6E3B);	// @ (0xDC7 * 8 + 3)
#define                                 PWM4OFL3_bit        _BIT_ACCESS(PWM4OFL,3)
// PWM4OFL<PWM4OFL4>
extern volatile __bit                   PWM4OFL4            __at(0x6E3C);	// @ (0xDC7 * 8 + 4)
#define                                 PWM4OFL4_bit        _BIT_ACCESS(PWM4OFL,4)
// PWM4OFL<PWM4OFL5>
extern volatile __bit                   PWM4OFL5            __at(0x6E3D);	// @ (0xDC7 * 8 + 5)
#define                                 PWM4OFL5_bit        _BIT_ACCESS(PWM4OFL,5)
// PWM4OFL<PWM4OFL6>
extern volatile __bit                   PWM4OFL6            __at(0x6E3E);	// @ (0xDC7 * 8 + 6)
#define                                 PWM4OFL6_bit        _BIT_ACCESS(PWM4OFL,6)
// PWM4OFL<PWM4OFL7>
extern volatile __bit                   PWM4OFL7            __at(0x6E3F);	// @ (0xDC7 * 8 + 7)
#define                                 PWM4OFL7_bit        _BIT_ACCESS(PWM4OFL,7)
// PWM4OFCON<PWM4OFM0>
extern volatile __bit                   PWM4OFM0            __at(0x6E85);	// @ (0xDD0 * 8 + 5)
#define                                 PWM4OFM0_bit        _BIT_ACCESS(PWM4OFCON,5)
// PWM4OFCON<PWM4OFM1>
extern volatile __bit                   PWM4OFM1            __at(0x6E86);	// @ (0xDD0 * 8 + 6)
#define                                 PWM4OFM1_bit        _BIT_ACCESS(PWM4OFCON,6)
// PWM4OFCON<PWM4OFMC>
extern volatile __bit                   PWM4OFMC            __at(0x6E84);	// @ (0xDD0 * 8 + 4)
#define                                 PWM4OFMC_bit        _BIT_ACCESS(PWM4OFCON,4)
// PWM4OFCON<PWM4OFS0>
extern volatile __bit                   PWM4OFS0            __at(0x6E80);	// @ (0xDD0 * 8 + 0)
#define                                 PWM4OFS0_bit        _BIT_ACCESS(PWM4OFCON,0)
// PWM4OFCON<PWM4OFS1>
extern volatile __bit                   PWM4OFS1            __at(0x6E81);	// @ (0xDD0 * 8 + 1)
#define                                 PWM4OFS1_bit        _BIT_ACCESS(PWM4OFCON,1)
// PWM4CON<PWM4OUT>
extern volatile __bit                   PWM4OUT             __at(0x6E5D);	// @ (0xDCB * 8 + 5)
#define                                 PWM4OUT_bit         _BIT_ACCESS(PWM4CON,5)
// PWMOUT<PWM4OUT_A>
extern volatile __bit                   PWM4OUT_A           __at(0x6C83);	// @ (0xD90 * 8 + 3)
#define                                 PWM4OUT_A_bit       _BIT_ACCESS(PWMOUT,3)
// PWM4PHH<PWM4PHH0>
extern volatile __bit                   PWM4PHH0            __at(0x6E10);	// @ (0xDC2 * 8 + 0)
#define                                 PWM4PHH0_bit        _BIT_ACCESS(PWM4PHH,0)
// PWM4PHH<PWM4PHH1>
extern volatile __bit                   PWM4PHH1            __at(0x6E11);	// @ (0xDC2 * 8 + 1)
#define                                 PWM4PHH1_bit        _BIT_ACCESS(PWM4PHH,1)
// PWM4PHH<PWM4PHH2>
extern volatile __bit                   PWM4PHH2            __at(0x6E12);	// @ (0xDC2 * 8 + 2)
#define                                 PWM4PHH2_bit        _BIT_ACCESS(PWM4PHH,2)
// PWM4PHH<PWM4PHH3>
extern volatile __bit                   PWM4PHH3            __at(0x6E13);	// @ (0xDC2 * 8 + 3)
#define                                 PWM4PHH3_bit        _BIT_ACCESS(PWM4PHH,3)
// PWM4PHH<PWM4PHH4>
extern volatile __bit                   PWM4PHH4            __at(0x6E14);	// @ (0xDC2 * 8 + 4)
#define                                 PWM4PHH4_bit        _BIT_ACCESS(PWM4PHH,4)
// PWM4PHH<PWM4PHH5>
extern volatile __bit                   PWM4PHH5            __at(0x6E15);	// @ (0xDC2 * 8 + 5)
#define                                 PWM4PHH5_bit        _BIT_ACCESS(PWM4PHH,5)
// PWM4PHH<PWM4PHH6>
extern volatile __bit                   PWM4PHH6            __at(0x6E16);	// @ (0xDC2 * 8 + 6)
#define                                 PWM4PHH6_bit        _BIT_ACCESS(PWM4PHH,6)
// PWM4PHH<PWM4PHH7>
extern volatile __bit                   PWM4PHH7            __at(0x6E17);	// @ (0xDC2 * 8 + 7)
#define                                 PWM4PHH7_bit        _BIT_ACCESS(PWM4PHH,7)
// PWM4INTE<PWM4PHIE>
extern volatile __bit                   PWM4PHIE            __at(0x6E62);	// @ (0xDCC * 8 + 2)
#define                                 PWM4PHIE_bit        _BIT_ACCESS(PWM4INTE,2)
// PWM4INTF<PWM4PHIF>
extern volatile __bit                   PWM4PHIF            __at(0x6E6A);	// @ (0xDCD * 8 + 2)
#define                                 PWM4PHIF_bit        _BIT_ACCESS(PWM4INTF,2)
// PWM4PHL<PWM4PHL0>
extern volatile __bit                   PWM4PHL0            __at(0x6E08);	// @ (0xDC1 * 8 + 0)
#define                                 PWM4PHL0_bit        _BIT_ACCESS(PWM4PHL,0)
// PWM4PHL<PWM4PHL1>
extern volatile __bit                   PWM4PHL1            __at(0x6E09);	// @ (0xDC1 * 8 + 1)
#define                                 PWM4PHL1_bit        _BIT_ACCESS(PWM4PHL,1)
// PWM4PHL<PWM4PHL2>
extern volatile __bit                   PWM4PHL2            __at(0x6E0A);	// @ (0xDC1 * 8 + 2)
#define                                 PWM4PHL2_bit        _BIT_ACCESS(PWM4PHL,2)
// PWM4PHL<PWM4PHL3>
extern volatile __bit                   PWM4PHL3            __at(0x6E0B);	// @ (0xDC1 * 8 + 3)
#define                                 PWM4PHL3_bit        _BIT_ACCESS(PWM4PHL,3)
// PWM4PHL<PWM4PHL4>
extern volatile __bit                   PWM4PHL4            __at(0x6E0C);	// @ (0xDC1 * 8 + 4)
#define                                 PWM4PHL4_bit        _BIT_ACCESS(PWM4PHL,4)
// PWM4PHL<PWM4PHL5>
extern volatile __bit                   PWM4PHL5            __at(0x6E0D);	// @ (0xDC1 * 8 + 5)
#define                                 PWM4PHL5_bit        _BIT_ACCESS(PWM4PHL,5)
// PWM4PHL<PWM4PHL6>
extern volatile __bit                   PWM4PHL6            __at(0x6E0E);	// @ (0xDC1 * 8 + 6)
#define                                 PWM4PHL6_bit        _BIT_ACCESS(PWM4PHL,6)
// PWM4PHL<PWM4PHL7>
extern volatile __bit                   PWM4PHL7            __at(0x6E0F);	// @ (0xDC1 * 8 + 7)
#define                                 PWM4PHL7_bit        _BIT_ACCESS(PWM4PHL,7)
// PWM4CON<PWM4POL>
extern volatile __bit                   PWM4POL             __at(0x6E5C);	// @ (0xDCB * 8 + 4)
#define                                 PWM4POL_bit         _BIT_ACCESS(PWM4CON,4)
// PWM4PRH<PWM4PRH0>
extern volatile __bit                   PWM4PRH0            __at(0x6E30);	// @ (0xDC6 * 8 + 0)
#define                                 PWM4PRH0_bit        _BIT_ACCESS(PWM4PRH,0)
// PWM4PRH<PWM4PRH1>
extern volatile __bit                   PWM4PRH1            __at(0x6E31);	// @ (0xDC6 * 8 + 1)
#define                                 PWM4PRH1_bit        _BIT_ACCESS(PWM4PRH,1)
// PWM4PRH<PWM4PRH2>
extern volatile __bit                   PWM4PRH2            __at(0x6E32);	// @ (0xDC6 * 8 + 2)
#define                                 PWM4PRH2_bit        _BIT_ACCESS(PWM4PRH,2)
// PWM4PRH<PWM4PRH3>
extern volatile __bit                   PWM4PRH3            __at(0x6E33);	// @ (0xDC6 * 8 + 3)
#define                                 PWM4PRH3_bit        _BIT_ACCESS(PWM4PRH,3)
// PWM4PRH<PWM4PRH4>
extern volatile __bit                   PWM4PRH4            __at(0x6E34);	// @ (0xDC6 * 8 + 4)
#define                                 PWM4PRH4_bit        _BIT_ACCESS(PWM4PRH,4)
// PWM4PRH<PWM4PRH5>
extern volatile __bit                   PWM4PRH5            __at(0x6E35);	// @ (0xDC6 * 8 + 5)
#define                                 PWM4PRH5_bit        _BIT_ACCESS(PWM4PRH,5)
// PWM4PRH<PWM4PRH6>
extern volatile __bit                   PWM4PRH6            __at(0x6E36);	// @ (0xDC6 * 8 + 6)
#define                                 PWM4PRH6_bit        _BIT_ACCESS(PWM4PRH,6)
// PWM4PRH<PWM4PRH7>
extern volatile __bit                   PWM4PRH7            __at(0x6E37);	// @ (0xDC6 * 8 + 7)
#define                                 PWM4PRH7_bit        _BIT_ACCESS(PWM4PRH,7)
// PWM4INTE<PWM4PRIE>
extern volatile __bit                   PWM4PRIE            __at(0x6E60);	// @ (0xDCC * 8 + 0)
#define                                 PWM4PRIE_bit        _BIT_ACCESS(PWM4INTE,0)
// PWM4INTF<PWM4PRIF>
extern volatile __bit                   PWM4PRIF            __at(0x6E68);	// @ (0xDCD * 8 + 0)
#define                                 PWM4PRIF_bit        _BIT_ACCESS(PWM4INTF,0)
// PWM4PRL<PWM4PRL0>
extern volatile __bit                   PWM4PRL0            __at(0x6E28);	// @ (0xDC5 * 8 + 0)
#define                                 PWM4PRL0_bit        _BIT_ACCESS(PWM4PRL,0)
// PWM4PRL<PWM4PRL1>
extern volatile __bit                   PWM4PRL1            __at(0x6E29);	// @ (0xDC5 * 8 + 1)
#define                                 PWM4PRL1_bit        _BIT_ACCESS(PWM4PRL,1)
// PWM4PRL<PWM4PRL2>
extern volatile __bit                   PWM4PRL2            __at(0x6E2A);	// @ (0xDC5 * 8 + 2)
#define                                 PWM4PRL2_bit        _BIT_ACCESS(PWM4PRL,2)
// PWM4PRL<PWM4PRL3>
extern volatile __bit                   PWM4PRL3            __at(0x6E2B);	// @ (0xDC5 * 8 + 3)
#define                                 PWM4PRL3_bit        _BIT_ACCESS(PWM4PRL,3)
// PWM4PRL<PWM4PRL4>
extern volatile __bit                   PWM4PRL4            __at(0x6E2C);	// @ (0xDC5 * 8 + 4)
#define                                 PWM4PRL4_bit        _BIT_ACCESS(PWM4PRL,4)
// PWM4PRL<PWM4PRL5>
extern volatile __bit                   PWM4PRL5            __at(0x6E2D);	// @ (0xDC5 * 8 + 5)
#define                                 PWM4PRL5_bit        _BIT_ACCESS(PWM4PRL,5)
// PWM4PRL<PWM4PRL6>
extern volatile __bit                   PWM4PRL6            __at(0x6E2E);	// @ (0xDC5 * 8 + 6)
#define                                 PWM4PRL6_bit        _BIT_ACCESS(PWM4PRL,6)
// PWM4PRL<PWM4PRL7>
extern volatile __bit                   PWM4PRL7            __at(0x6E2F);	// @ (0xDC5 * 8 + 7)
#define                                 PWM4PRL7_bit        _BIT_ACCESS(PWM4PRL,7)
// PWM4CLKCON<PWM4PS0>
extern volatile __bit                   PWM4PS0             __at(0x6E74);	// @ (0xDCE * 8 + 4)
#define                                 PWM4PS0_bit         _BIT_ACCESS(PWM4CLKCON,4)
// PWM4CLKCON<PWM4PS1>
extern volatile __bit                   PWM4PS1             __at(0x6E75);	// @ (0xDCE * 8 + 5)
#define                                 PWM4PS1_bit         _BIT_ACCESS(PWM4CLKCON,5)
// PWM4CLKCON<PWM4PS2>
extern volatile __bit                   PWM4PS2             __at(0x6E76);	// @ (0xDCE * 8 + 6)
#define                                 PWM4PS2_bit         _BIT_ACCESS(PWM4CLKCON,6)
// PWM4TMRH<PWM4TMRH0>
extern volatile __bit                   PWM4TMRH0           __at(0x6E50);	// @ (0xDCA * 8 + 0)
#define                                 PWM4TMRH0_bit       _BIT_ACCESS(PWM4TMRH,0)
// PWM4TMRH<PWM4TMRH1>
extern volatile __bit                   PWM4TMRH1           __at(0x6E51);	// @ (0xDCA * 8 + 1)
#define                                 PWM4TMRH1_bit       _BIT_ACCESS(PWM4TMRH,1)
// PWM4TMRH<PWM4TMRH2>
extern volatile __bit                   PWM4TMRH2           __at(0x6E52);	// @ (0xDCA * 8 + 2)
#define                                 PWM4TMRH2_bit       _BIT_ACCESS(PWM4TMRH,2)
// PWM4TMRH<PWM4TMRH3>
extern volatile __bit                   PWM4TMRH3           __at(0x6E53);	// @ (0xDCA * 8 + 3)
